<?php 
return array(

    'DB_TYPE'   => 'mysqli', // 数据库类型
    'DB_HOST'   => 'rm-wz95lq01eiqt49i36.mysql.rds.aliyuncs.com', // 服务器地址 阿里云119.23.21.28 ，测试机39.108.169.131
    'DB_NAME'   => 'meicoolive', // 数据库名
    'DB_USER'   => 'meicoolive', // 用户名
    'DB_PWD'    => 'Xme8Tnn0oqM8jpjU',  // 密码
    'DB_PORT'   => '3306', // 端口
    'DB_PREFIX' => 'mc_', // 数据库表前缀

    'URL_CASE_INSENSITIVE' =>true, //不区分大小写
//模板相关配置
	'TMPL_PARSE_STRING' => array(
	   '__CSS__' => __ROOT__ . '/Application/' . MODULE_NAME . '/Static/css',
	   '__IMG__' => __ROOT__ . '/Application/' . MODULE_NAME . '/Static/img',
	   '__JS__' => __ROOT__ . '/Application/' . MODULE_NAME . '/Static/js',
       '__PUBLIC__'=> __ROOT__ . '/Public',
	),
    //关于路径配置
    'ADMIN_URL' =>'http://www.meikuxiu.com/newadmin/admin.php/',
    'ADMIN_ROOT' =>'http://www.meikuxiu.com/newadmin',
    'ADMIN_UPLOAD_ROOT' =>'/newadmin',

     /* 图片上传相关配置 */
    'PICTURE_UPLOAD' => array(
        'mimes' => '', //允许上传的文件MiMe类型
        'maxSize' => 0, //上传的文件大小限制 (0-不做限制)
        'exts' => 'jpg,gif,png,jpeg,swf', //允许上传的文件后缀
        'autoSub' => true, //自动子目录保存文件
        'subName' => array('date', 'Y-m-d'), //子目录创建方式，[0]-函数名，[1]-参数，多个参数使用数组
        'rootPath' => './Uploads/Img/', //保存根路径
        'dbPath' =>'/Uploads/Img/',
        'savePath' => '', //保存路径
        'saveName' => array('uniqid', ''), //上传文件命名规则，[0]-函数名，[1]-参数，多个参数使用数组
        'saveExt' => '', //文件保存后缀，空则使用原后缀
        'replace' => false, //存在同名是否覆盖
        'hash' => true, //是否生成hash编码
        'callback' => false, //检测文件是否存在回调函数，如果存在返回文件信息数组
    ), 
    

     '_DUMMY_NAME_'=>array(   //假人随机名字
        '一半痴迷两分疯癫','巧了我就是酷メ','邪性洒脱','我酷你随意','列表唯1酷Girl','怪性酷Girl','夳酷拒拜托','狂风般洒脱','丑才∫酷啊','&lt;酷酷ｄｅヽ老太太&gt;','疯癫灬中二','撩污酷野浪','酷的没边儿了的美尐女ゾ',
        '核能气质少年','无敌元气妹','性子来了，说变就变','别碰我的古怪','不俗可人儿','看起来太独特','潮人怪性','神秘鬼馬','酷到炸','怪异思维女','搞怪之王','灑脱又极端','Σ就是爱搞怪~~=3','美到没朋友','独特风格',
        '古里古怪的小性格','癫贤娃娃','疯就要疯的够独特','一身傲气王','爆笑气质姐','萌妹子的霸气范','半裸狂热者','情绪别致的疯子','女神经怎么了','疯到世界奔溃','野性酷女','怪咖小青年','逍遥自在唯我独','高傲控制不了我的低调',
        '你好，我叫很个性','二是＊我的个性','我疯我癫我骄傲','柠檬脾气','疯子般の我','偏执的傲','女王范儿爆棚','烟勤话少脾气爆','贱是一种态度','做個沒心沒肺菂尐女亽','嗜桖仦媄囡','去爱去疯去执着','霸道、是我的个性',
        '峥嵘岁月爱吐槽','喜旧之人~`','無法無天、逆态度','孤傲、也是一种态度゜','自嘲自闹自疯癫','有钳、任性','我很怪i','≮夲zúη拒绝爱≯','闷骚°是种气质美','請叫我丶偏執狂','崾赱の亽涐絕卟留','温情火光','留守，那思念',
        '纯爱〆','回首、那片琥珀色','夜空中最亮的星星i','梅花开７朵','那一季╯夏花落下 り','﹏你旳笑慌乱了我旳骄傲〃','小夏天。','歲月靜好','蓝天白裙少女','ツ薄荷凉莪吢°','期待丶下一季','夏有森光暖无疑','开满花的树',
        '愿我成为自己的太阳','那年夏、永恒','钢琴、废墟中奏响','木槿开成万花町c', '寻找、那份专属的幸福 ┛','就像蓝鲸忘了海','木已凉兮','雪花飘零，爱已成冰','她的眼睛会笑','碧海蓝天婚纱地！','风声来自人海','随风吹笛',
        '再为我唱一次','ぺ淡淡的天边月づ','淡陌丶 幽瑟玉琼情殇','小巷陌影','深海的那一抹蓝丶','|花样年华丶','见蝴蝶飞越森林','你用单手遮住了我的眼°','一米阳光安静的照耀っ','指尖上的星空〃','陌影灬','雨下的樱花★',
        '林空鹿饮溪','╰彼岸花開花落的流年╮','愿做春风暖人心','茶蘼花开丶我们相偎相依','惟愿时光善待青春年少つ','唯美的年华','花谢依然美','儚随偑澫裏﹏','天幕流光-','美丽的邂逅。','夜未央゛樱花落ζ','青丝蘸白雪',
        '笑眼醉人','风停了，云知道、','灬相约曾经','≮梦之★情缘≯','那年樱花，掉落满地','时光是记忆dē橡皮擦丶','﹎ 靜靜dē ﹏..．...〤','漫步云海涧','青衫烟雨','陌上青苔','低吟、幸福小情歌','一盏烛光',
        '- 再回忆都是空白','夜晚的摩天轮更加灿烂','白色季节','︱.陌ㄣ落｀','只想让你知道我真的很好','冷月','静若繁花*','、泪落旧城轻纱坠','黄昏雨落一池秋','蝉音弥夏','掌心里的海。','黑白幸福、微光迷失尘夏','漫步繁华街丶',
        'SE LU 谁家少年歌如水*','一曲爱恨情仇','时光镜千','春的气息','猫呓','梦念人.','梦一样的人生','初雪','、我笑得没心没肺╮','久居深海蓝透人心','斜阳下45° 微笑 ╮','墨色烟华','情歌對唱╮','耀眼的星火',
        '流星ゞ是心空滑过的一滴泪','天空是灰色°','窗里窗外皆有青色的光','茶暖桉','挪威的风,','你的眼眸闪烁着未来.﹌','森深不见路','四叶星光','恍梦境°','时光凉透初时模样。','时间海','云烟溪雪','雾里看小花','马不停蹄的忧伤。',
        '如果不是因为爱','疏雨未歇','把梦留给海!','风追烟花雨','殒落的樱花づ','┆靜侯メ輪徊','遙望地平線盡頭','梦有你而美','无力的、回忆','抵达生命的尽头╰っ','没有你丶太阳依旧灿烂','泪湿床','流年、乱浮生','心只是缺了一块。',
        '就算世界无童话','美丽的泪光','看海@','且听、风铃','广场中央。','〆夏未、回憶▁▁','你是暖光i','╰’背对阳光 闭眼','ミ記憶de承渃','心灵的触动、','情到深处人自醉','静静的秋','思念,是无法穿越的距离','温暖慕城。',),
    '_DUMMY_SEX_' =>array('0','1'),//假人随机性别
    '_DUMMY_EXP_'=>array('100','200','300','400','20000','8000','12000','50000','900'),//随机经验
    '_DUMMY_FACE_'=>array(
        './Application/Admin/Static/user/dummy/1.jpg',
        './Application/Admin/Static/user/dummy/2.jpg',
        './Application/Admin/Static/user/dummy/3.jpg',
        './Application/Admin/Static/user/dummy/4.jpg',
        './Application/Admin/Static/user/dummy/5.jpg',
        './Application/Admin/Static/user/dummy/6.jpg',
        './Application/Admin/Static/user/dummy/7.jpg',
        './Application/Admin/Static/user/dummy/8.jpg',
        './Application/Admin/Static/user/dummy/9.jpg',
        './Application/Admin/Static/user/dummy/10.jpg',
        './Application/Admin/Static/user/dummy/11.jpg',
        './Application/Admin/Static/user/dummy/12.jpg',
        './Application/Admin/Static/user/dummy/13.jpg',
        ),//随机头像
    'DEFAULT_USER_FACE' => './Application/Admin/Static/user/dummy/13.jpg'
)
?>